# IsCropRegionShapeValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..IsCropRegionShapeValid Method
ViewCropRegionShapeManager Class See Also
---
Verifies that boundary represents one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsCropRegionShapeValid(
	CurveLoop boundary
)
```

Visual Basic
---
```text
Public Function IsCropRegionShapeValid ( _
	boundary As CurveLoop _
) As Boolean
```

Visual C++
---
```text
public:
bool IsCropRegionShapeValid(
	CurveLoop^ boundary
)
```

# ### Parameters
boundary
    Type: Autodesk.Revit.DB..::..CurveLoop The crop boundary.
# ### Return Value
True if the passed crop boundary represents one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.
# Remarks
Curves in boundary use model coordinates.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace